backend/app/controllers/advices_controller.rb

SELECT "advices".* FROM "advices"
---
    def index #list of advices
        advices = Advice.all

SELECT "advices".* FROM "advices" WHERE "advices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show #individual record. one advice
        advice = Advice.find(params[:id])