backend/app/controllers/emails_controller.rb

SELECT "emails".* FROM "emails"
---
    def index #list of emails
        emails = Email.all

INSERT INTO "emails" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "hi@hi.com"], ["created_at", "2020-03-26 15:35:35.835028"], ["updated_at", "2020-03-26 15:35:35.835028"]]
---
    def create
        email = Email.new(email: params[:email])
        pp email
        if email.save