backend/app/controllers/pastimes_controller.rb

    def index #list of pastimes
        pastimes = Pastime.all
---
SELECT "pastimes".* FROM "pastimes"

    def show #individual record. one pastime
        pastime = Pastime.find(params[:id])
---
SELECT "pastimes".* FROM "pastimes" WHERE "pastimes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        pastime = Pastime.new(allowed_params)

        if pastime.save
---
INSERT INTO "pastimes" ("name", "content", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "dasdasdas"], ["content", "dasdasdaqqqqqqqqqqq"], ["title", "qqqqqqqqzzxxxxxxxxxxx"], ["created_at", "2020-03-24 16:23:29.628263"], ["updated_at", "2020-03-24 16:23:29.628263"]]

    def update
        pastime = Pastime.find(params[:id])
        pastime[:like_count] = params[:like_count]
        if pastime.save
---
SELECT "pastimes".* FROM "pastimes" WHERE "pastimes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "pastimes" SET "like_count" = ?, "updated_at" = ? WHERE "pastimes"."id" = ?  [["like_count", 4], ["updated_at", "2020-03-26 21:42:03.467733"], ["id", 3]]