backend/app/controllers/ratings_controller.rb

    def index #list of ratings
        ratings = Rating.all
---
SELECT "ratings".* FROM "ratings"

    def create
        rating = Rating.new(allowed_params)

        if rating.save
---
INSERT INTO "ratings" ("rate", "pastime_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["rate", 4], ["pastime_id", 4], ["created_at", "2020-03-24 16:19:33.672850"], ["updated_at", "2020-03-24 16:19:33.672850"]]

    def destroy
        rating = Rating.find(params[:id])
        rating.destroy
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "ratings" WHERE "ratings"."id" = ?  [["id", 1]]