backend/app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags"
---
    def index #list of tags
        tags = Tag.all

INSERT INTO "tags" ("name", "advice_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "what not to do during the quarentine"], ["advice_id", 3], ["created_at", "2020-03-24 16:41:54.449065"], ["updated_at", "2020-03-24 16:41:54.449065"]]
---
    def create
        tag = Tag.new(allowed_params)

        if tag.save